vim:enc=utf8:ts=4:tw=0
--------------------------------------------------------------------------------

* 使用限定重複長度時的陷阱

	s,\(^A\)\{2,3\},K_\1_K,g 會發生錯誤, 因為此時的分隔字元為 , 而 \{2,3\} 
	是用 , 分開的. 因此要將分隔字元改掉, 如下:

	s/\(^A\)\{2,3\}/K_\1_K/g

--------------------------------------------------------------------------------

* 使用 extended regular expression 注意事項

	在 sed 中若要使用 extended regular expression 時

	若要找 ABC? 必須輸入 ABC\?

	若要找 ABC+ 必須輸入 ABC\+

	若要找 ABC{2,} 必須輸入 ABC\{2,\}

	若要找 ebook(doc|pdf) 必須輸入 ebook\(doc\|pdf\)


	反正, 就是都要加上 \ 就是了

--------------------------------------------------------------------------------
